app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Here is a comment to this post."], ["created_at", Tue, 11 Aug 2015 18:15:30 UTC +00:00], ["post_id", 3], ["updated_at", Tue, 11 Aug 2015 18:15:30 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: comment, creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 19 Aug 2015 15:58:06 UTC +00:00], ["updated_at", Wed, 19 Aug 2015 15:58:06 UTC +00:00], ["user_id", 7], ["vote", false], ["voteable_id", 1], ["voteable_type", "Comment"]]