app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse

INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 07 Aug 2015 17:56:14 UTC +00:00], ["description", "Some description\r\n"], ["title", "Some title"], ["updated_at", Fri, 07 Aug 2015 17:56:14 UTC +00:00], ["url", "Some URL"]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 19 Aug 2015 15:10:09 UTC +00:00], ["updated_at", Wed, 19 Aug 2015 15:10:09 UTC +00:00], ["user_id", 7], ["vote", true], ["voteable_id", 2], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])