app/controllers/posts_controller.rb

  def create
  	@post = Post.new(post_params)
    @post.creator = User.first # TODO: Change once we have authentication
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1