app/controllers/users_controller.rb

UPDATE "users" SET "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["time_zone", "Eastern Time (US & Canada)"], ["updated_at", Tue, 18 Aug 2015 19:50:56 UTC +00:00]]
---
  def update
    if @user.update(user_params)