app/views/categories/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ?  [["category_id", 1]]
SELECT 1 AS one FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ? LIMIT 1  [["category_id", 5]]
---

<% if @category.posts.empty? %>